Table of Contents
 Class LoadCase
Namespace
IdeaRS.OpenModel.Detail.Loading
Assembly
IdeaRS.OpenModel.dll
Load case
public class LoadCase : CalculationCase
Inheritance
object
OpenObject
OpenElementId
CalculationCase
LoadCase
Inherited Members
 CalculationCase.Name
 CalculationCase.IsActive
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 LoadCase()
Constructor
public LoadCase()
Properties
 Load
Load
public List<LoadBase> Load { get; set; }
Property Value
List<LoadBase>
 LoadCaseType
Type of load case
public LoadCaseType LoadCaseType { get; set; }
Property Value
LoadCaseType
 Edit this page